Repository: chasey-myagi/Sapphire
Catalog: Sapphire/App/InfoPlist.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# NSAppleEventsUsageDescription
source: Sapphire needs access to control playback and read track information from Music and Spotify.
zh_hans: Sapphire 需要控制 Music 和 Spotify 的播放，并读取歌曲信息。
zh_hant: Sapphire 需要取用權限，才能控制「音樂」和 Spotify 的播放並讀取曲目資訊。

# NSAppleMusicUsageDescription
source: Used to show upcming songs and playlists within apple music
zh_hans: 用于在 Apple Music 中显示待播放歌曲和播放列表。
zh_hant: 用於在 Apple Music 中顯示即將播放的歌曲和播放列表。

# NSAudioCaptureUsageDescription
source: Sapphire listens to your music app's audio on this Mac to time lyrics word by word. The audio never leaves your Mac.
zh_hans: Sapphire 会在此 Mac 上读取音乐应用的音频，以逐字同步歌词。音频不会离开你的 Mac。
zh_hant: Sapphire 會在這台 Mac 上聆聽你的音樂 App 音訊，以逐字同步歌詞。音訊絕不會離開你的 Mac。

# NSBluetoothAlwaysUsageDescription
source: Sapphire uses Bluetooth for device connection notifications, battery status, and proximity-based unlock.
zh_hans: Sapphire 使用蓝牙显示设备连接通知和电池状态，并提供近距离解锁。
zh_hant: Sapphire 使用藍牙顯示裝置連線通知和電池狀態，並提供近距離解鎖。

# NSCalendarsFullAccessUsageDescription
source: Sapphire needs calendar permission to show upcoming events
zh_hans: Sapphire 需要访问日历来显示即将开始的日程。
zh_hant: Sapphire 需要行事曆權限來顯示即將到來的行程。

# NSCalendarsUsageDescription
source: Sapphire uses calendar access to show upcoming events.
zh_hans: Sapphire 使用日历权限显示即将到来的日程。
zh_hant: Sapphire 使用行事曆取用權限顯示即將到來的行程。

# NSCameraUsageDescription
source: Sapphire uses the camera for the Mirror widget so you can see yourself in the notch.
zh_hans: Sapphire 使用摄像头提供镜子小组件，让你能在刘海区域看到自己。
zh_hant: Sapphire 使用相機提供「鏡子」小工具，讓你可以在瀏海區域中看到自己。

# NSContactsUsageDescription
source: Sapphire needs access to your contacts to find the correct phone number or email when sending a reply from a notification.
zh_hans: Sapphire 需要访问通讯录，以便在回复通知时找到正确的电话号码或电子邮件地址。
zh_hant: Sapphire 需要取用你的聯絡人，以便從通知傳送回覆時找到正確的電話號碼或電子郵件。

# NSFocusStatusUsageDescription
source: Needed to provide live focus updates
zh_hans: 用于实时更新专注状态。
zh_hant: 用於提供即時的專注狀態更新。

# NSLocalNetworkUsageDescription
source: Sapphire uses the local network for Nearby Share transfers and music device connections.
zh_hans: Sapphire 使用本地网络进行附近共享文件传输和音乐设备连接。
zh_hant: Sapphire 使用區域網路進行 Nearby Share 檔案傳輸和音樂裝置連線。

# NSLocationAlwaysAndWhenInUseUsageDescription
source: Needed to provide live weather updates
zh_hans: 用于实时更新天气。
zh_hant: 用於提供即時的天氣更新。

# NSLocationUsageDescription
source: Sapphire needs this to weather
zh_hans: Sapphire 需要使用位置来提供天气信息。
zh_hant: Sapphire 需要此權限以提供天氣資訊。

# NSLocationWhenInUseUsageDescription
source: Sapphire uses your location to show local weather.
zh_hans: Sapphire 使用你的位置显示本地天气。
zh_hant: Sapphire 使用你的位置顯示當地天氣。

# NSMicrophoneUsageDescription
source: Sapphire uses the microphone for audio capture.
zh_hans: Sapphire 使用麦克风采集音频。
zh_hant: Sapphire 使用麥克風擷取音訊。

# NSNetworkVolumesUsageDescription
source: Sapphire needs this to provide nearby share functionality
zh_hans: Sapphire 需要访问网络宗卷来提供附近互传功能。
zh_hant: Sapphire 需要此權限以提供 Nearby Share 功能。

# NSRemindersFullAccessUsageDescription
source: Sapphire needs this to show upcoming reminders
zh_hans: Sapphire 需要访问提醒事项来显示即将到来的提醒。
zh_hant: Sapphire 需要此權限以顯示即將到來的提醒事項。

# NSRemindersUsageDescription
source: Needed to show reminders
zh_hans: 用于显示提醒事项。
zh_hant: 用於顯示提醒事項。

# NSScreenCaptureUsageDescription
source: Sapphire uses screen recording for per-app audio capture and live window previews.
zh_hans: Sapphire 使用屏幕录制权限采集应用音频并显示实时窗口预览。
zh_hant: Sapphire 使用螢幕錄製權限擷取各 App 音訊並顯示即時視窗預覽。
